# На предприятии каждой изготовленной детали присваивают серийный номер,
# содержащий десятичные цифры, 52 латинские буквы (с учётом регистра) и символы из 1460-символьного специального алфавита.
# В базе данных для хранения каждого серийного номера отведено одинаковое и минимально возможное число байт.
# При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым и минимально возможным числом бит.
# Известно, что для хранения 1550 серийных номеров отведено не более 256 Кбайт памяти. Определите максимально возможную длину серийного номера.
# В ответе запишите только целое число.
# from math import *
# k = 1550
# N = 10 + 52 + 1460
# ids_size = 256 * 2 ** 10
# i = ceil(log2(N))
# I = ids_size / k
# L = I * 8 / i
# print((I))

# Каждому изготовленному на заводе подшипнику присваивается уникальный серийный номер,
# содержащий символы из 80-символьного специального алфавита.
# В базе данных каждый серийный номер занимает одинаковое и минимально возможное число байт.
# При этом используется посимвольное кодирование серийный номеров,
# все символы кодируются одинаковым и минимально возможным числом бит.
# Известно, что 256 серийных номеров занимают более 24 Кбайт памяти.
# Определите максимально возможную длину серийного номера.
# В ответе запишите только целое число.
# from math import *
# # k = 256
# # N = 80
# # ids_size = 24 * 2 ** 10
# # i = ceil(log2(N))
# # I = ids_size / k
# # L = I * 8 / i
# # print(ceil(L))

# При регистрации в компьютерной системе каждому объекту присваивается идентификатор,
# содержащий десятичные цифры, 52 латинские буквы и символы из 2028-символьного специального алфавита.
# В базе данных для хранения каждого идентификатора отведено одинаковое и минимально возможное число байт.
# При этом используется посимвольное кодирование идентификаторов, все символы кодируются одинаковым и минимально возможным числом бит.
# Известно, что для хранения 1256 идентификаторов отведено более 12 Мбайт памяти. Определите минимально возможную длину идентификатора.
# В ответе запишите только целое число
# from math import *
# k = 1256
# N = 10 + 52 + 2028
# ids_size = 12 * 2 ** 20
# i = ceil(log2(N))
# I = ids_size / k
# L = I * 8 / i
# print(floor(L))

# При регистрации в компьютерной системе каждому объекту присваиваетстифя иденикатор,
# состоящий из 317 символов и содержащий только десятичные цифры и символы из 4090-символьного специального алфавита.
# В базе данных для хранения каждого идентификатора отведено одинаковое и минимально возможное целое число байт.
# При этом используется посимвольное кодирование идентификаторов, все символы кодируются одинаковым и минимально возможным количеством бит.
# Определите объём памяти (в Мбайт), необходимый для хранения 262 144 идентификаторов.
# from math import *
# k = 262144
# N = 10 + 4090
# L = 317
# i = ceil(log2(N))
# I = ceil(L * i / 2 ** 3)
# ids_size = (I * k) / 2 ** 20
# print(ids_size)
# При регистрации в компьютерной системе каждому пользователю выдаётся пароль,
# состоящий из 7 символов и содержащий только символы 26-символьного набора строчных латинских букв и десяти арабских цифр.
# В базе данных для хранения сведений о каждом пользователе отведено одинаковое и минимально возможное целое число байт.
#  При этом используют посимвольное кодирование паролей, все символы кодируют одинаковым и минимально возможным количеством бит.
# Кроме собственно пароля, для каждого пользователя в системе хранятся дополнительные сведения, для чего отведено 9 байт на одного пользователя.
# Определите объём памяти (в байтах), необходимый для хранения сведений о 30 пользователях.
# В ответе запишите только целое число – количество байт.
# from math import *
# N = 36
# dop = 9
# L = 7
# D = 30
# i = ceil(log2(N))
# I = ceil(L * i / 8)
# ids_size = (I + dop) * D
# print(ids_size)
# При регистрации в компьютерной системе каждому объекту присваивается идентификатор,
# состоящий из 5 символов и содержащий только десятичные цифры и символы из 7084-символьного специального алфавита.
# В базе данных для хранения каждого идентификатора отведено одинаковое и минимально возможное целое число байт.
# При этом используется посимвольное кодирование идентификаторов, все символы кодируются одинаковым и минимально возможным количеством бит.
# Определите объём памяти (в Кбайт), необходимый для хранения 22 528 идентификаторов. В ответе запишите только целое число – количество Кбайт.
# from math import *
# N = 10 + 7084
# L = 5
# k = 22528
# i = ceil(log2(N))
# I = ceil(L * i / 2 ** 3)
# ids_size = (k * I) / 2 ** 10
# print(ids_size)
# При регистрации в компьютерной системе каждому объекту присваивается идентификатор,
# состоящий из 912 символов и содержащий только десятичные цифры и символы из 500-символьного специального алфавита.
# В базе данных для хранения каждого идентификатора отведено одинаковое и минимально возможное целое число байт.
# При этом используется посимвольное кодирование идентификаторов, все символы кодируются одинаковым и минимально возможным количеством бит.
# Определите объём памяти (в Кбайт), необходимый для хранения 1256 идентификаторов.
# В ответе запишите только целое число – количество Кбайт.
# from math import *
# L = 912
# N = 10 + 500
# k = 1256
# i = ceil(log2(N))
# I = ceil(L * i / 2 ** 3)
# ids_size = (k * I) / 2 ** 10
# print(ids_size)
# При регистрации в компьютерной системе каждому объекту присваивается идентификатор,
# состоящий из 5 символов и содержащий только десятичные цифры и символы из 2048-символьного специального алфавита.
# В базе данных для хранения каждого идентификатора отведено одинаковое и минимально возможное целое число байт.
# При этом используется посимвольное кодирование идентификаторов, все символы кодируются одинаковым и минимально возможным количеством бит.
# Определите объём памяти (в Кбайт), необходимый для хранения 22 528 идентификаторов. В ответе запишите только целое число – количество Кбайт.
# from math import *
# L = 5
# N = 10 + 2048
# k = 22528
# i = ceil(log2(N))
# I = ceil(L * i / 2 ** 3)
# ids_size = (k * I) / 2 ** 10
# print(ids_size)

# На предприятии каждой изготовленной детали присваивают серийный номер,
# содержащий десятичные цифры, 52 латинские буквы (с учётом регистра) и символы из 1460-символьного специального алфавита.
# В базе данных для хранения каждого серийного номера отведено одинаковое и минимально возможное число байт.
# При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым и минимально возможным числом бит.
# Известно, что для хранения 1550 серийных номеров отведено не более 256 Кбайт памяти. Определите максимально возможную длину серийного номера.
# В ответе запишите только целое число.
# from math import *
# k = 1550
# N = 10 + 52 + 1460
# ids_size = 256 * 2 ** 10
# i = ceil(log2(N))
# I = ids_size / k
# L = I * 8 / i
# print((I))

# На предприятии каждой изготовленной детали присваивают серийный номер,
# состоящий из 252 символов. В базе данных каждый серийный номер занимает одинаковое и минимально возможное число байт.
# При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым и минимально возможным числом бит.
# Известно, что для хранения 356 984 серийных номеров потребовалось не менее 54 Мбайт памяти.
# Определите минимально возможную мощность алфавита, используемого для записи серийных номеров.
# В ответе запишите только целое число.
# from math import *
# N = 252
# k = 356984
# ids_size = 54 * 2 ** 20
# min_V_baits = ceil(ids_size / k)
# min_V_bits = min_V_baits * 8
# kol_bit_na_simvol = ceil(min_V_bits / N)
# N = 2 ** (kol_bit_na_simvol - 1) + 1
# print(N)
# На предприятии каждой изготовленной детали присваивают серийный номер,
# состоящий из 412 символов.
# В базе данных для хранения каждого серийного номера отведено одинаковое и минимально возможное число байт.
# При этом используется посимвольное кодирование серийных номеров,
# все символы кодируются одинаковым и минимально возможным числом бит.
# Известно, 1024 серийных номеров занимают более 512 Кбайт памяти.
# Определите минимально возможную мощность алфавита, используемого для записи серийных номеров.
# В ответе запишите только целое число.
# from math import *
# N = 412
# k = 1024
# ids_size = 512 * 2 ** 10
# min_V_baits = ceil(ids_size / k)
# min_V_bits = min_V_baits * 8
# kol_bit_na_simvol = ceil(min_V_bits / N)
# N = 2 ** (kol_bit_na_simvol - 1) + 1
# print(N)

# На предприятии каждой изготовленной детали присваивается серийный номер,
# состоящий из 248 символов.
# В базе данных для хранения каждого серийного номера отведено одинаковое и минимально возможное число байт.
# При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым и минимально возможным числом бит.
# Известно, что для хранения 75 600 серийных номеров требуется более 16 Мбайт памяти.
# Определите минимально возможную мощность алфавита, используемого для записи серийных номеров.
# В ответе запишите только целое число.
# from math import *
# k = 75600
# N = 248
# ids_size = 16 * 2 ** 20
# min_V_baits = ceil(ids_size / k)
# min_V_bits = min_V_baits * 8
# kol_bit_na_simvol = ceil(min_V_bits / N)
# N = 2 ** (kol_bit_na_simvol - 1) + 1
# print(N)
# На предприятии каждой изготовленной детали присваивают серийный номер, состоящий из 257 символов.
# В базе данных для хранения каждого серийного номера отведено одинаковое и минимально возможное число байт.
# При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым и минимально возможным числом бит.
# Известно, что для хранения 295 740 серийных номеров отведено не более 33 Мбайт памяти.
# Определите максимально возможную мощность алфавита, используемого для записи серийных номеров.
# from math import *
# k = 295740
# N = 257
# ids_size = 33 * 2 ** 20
# min_V_baits = ceil(ids_size / k)
# min_V_bits = min_V_baits * 8
# kol_bit_na_simvol = (min_V_bits / N)
# N = 2 ** (kol_bit_na_simvol - 1) + 1
# print(ceil(N))

# На предприятии каждой изготовленной детали присваивают серийный номер, состоящий из 119 символов.
# В базе данных для хранения каждого серийного номера отведено одинаковое и минимально возможное число байт.
# При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым и минимально возможным числом бит.
# Известно, 125 300 серийных номеров занимают более 23 Мбайт памяти. Определите минимально возможную мощность алфавита, используемого для записи серийных номеров.
# В ответе запишите только целое число.
# from math import *
# N = 119
# k = 125300
# ids_size = 23 * 2 ** 20
# min_V_baits = ceil(ids_size / k)
# min_V_bits = min_V_baits * 8
# kol_bit_na_simvol = ceil(min_V_bits / N)
# N = 2 ** (kol_bit_na_simvol - 1) + 1
# print(N)
# На предприятии каждой изготовленной детали присваивают серийный номер, состоящий из 172 символов.
# В базе данных каждый серийный номер занимает одинаковое и минимально возможное число байт.
# При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым и минимально возможным числом бит.
# Известно, что для хранения 356 984 серийных номеров потребовалось не менее 54 Мбайт памяти.
# Определите минимально возможную мощность алфавита, используемого для записи серийных номеров. В ответе запишите только целое число.
# from math import *
# N = 172
# k = 356984
# ids_size = 54 * 2 ** 20
# min_V_baits = ceil(ids_size / k)
# min_V_bits = min_V_baits * 8
# kol_bit_na_simvol = ceil(min_V_bits / N)
# N = 2 ** (kol_bit_na_simvol - 1) + 1
# print(N)
