# from math import ceil
# strok = 1247
# na_1_stranice = 35
# h = ceil(strok / na_1_stranice)
# print(h)

# cislo = 347
# desytki = cislo // 10
# print(desytki)

# n = 44000
# i = 32
# tracks = 12
# time = 42 * 60 + 30
# header = 110 * 2 ** 13
# bitrate = 295905280
# k = 4
# V = k * time * i * n
# V_album = V + header * 15
# q = V_album / bitrate
# print(q)

# k = 2
# n = 12000
# i = 24
# time = 3 * 60 + 19
# V = k * time * i * n
# print(V // 2 ** 13)

# k = 4
# i = 32
# n = 96000
# time = 3 * 60 + 20
# bitrate = 1280000
# n2 = 96000 // 2
# i2 = 44000
# tracks = 16
# V1 = k * time * i * n
# V2 = k * time * i2 * n2
# print(V1 // V2)


# N - мощность нашего алфавита ()
# i = log2(N)
# N = 2 ** i
# I = L * i - общий вес сообщения

# L = I / i - длина одного сообщения
# 5,2 -> округляем в меньшую сторону

# На предприятии каждой изготовленной детали присваивают серийный номер, содержащий десятичные цифры,
# 52 латинские буквы (с учётом регистра) и символы из 963-символьного специального алфавита.
# В базе данных для хранения каждого серийного номера отведено одинаковое и минимально возможное число байт.
# При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым и минимально возможным числом бит.
# Известно, что для хранения 2000 серийных номеров отведено не более 693 Кбайт памяти. Определите максимально возможную длину серийного номера.
# В ответе запишите только целое число

# from math import log2,ceil
# ids_size = 693 * 2 ** 10
# k = 2000
# N = 10 + 52 + 963
# i = ceil(log2(N))
# I = int(ids_size // k)
# L = I * 8 / i
# print(int(L))

# При регистрации в компьютерной системе каждому объекту присваивается идентификатор,
# содержащий десятичные цифры, 26 латинских букв в верхнем регистре и символы из 2013-символьного специального алфавита.
# В базе данных для хранения каждого идентификатора отведено одинаковое и минимально возможное число байт.
# При этом используется посимвольное кодирование идентификаторов, все символы кодируются одинаковым и минимально возможным числом бит.
# Известно, что для хранения 2050 идентификаторов отведено более 709 Кбайт памяти. Определите минимально возможную длину идентификатора.
# В ответе запишите только целое число
# from math import *
# ids_size = 709 * 2 ** 10 #-> байты
# k = 2050
# N = 10 + 26 + 2013
# i = ceil(log2(N)) #-> бит
# I = int(ids_size / k) #-> байт
# L = I * 8 / i
# print(int(L))

# Каждому изготовленному на заводе двигателю присваивается уникальный серийный номер,
# содержащий десятичные цифры и символы из 70-символьного специального алфавита.
# В базе данных каждый серийный номер занимает одинаковое и минимально возможное число байт.
# При этом используется посимвольное кодирование серийный номеров, все символы кодируются одинаковым и минимально возможным числом бит.
# Известно, что 1 234 567 серийных номеров занимают более 24 Мбайт памяти.
# Определите максимально возможную длину серийного номера. В ответе запишите только целое число.
# from math import *
# k = 1234567
# N = 70 + 10
# ids_size = 24 * 2 ** 20
# i = ceil(log2(N))
# I = ceil(ids_size / k) # байты
# L = I * 8 / i # i - биты
# print(L)

# На предприятии каждой изготовленной детали присваивают серийный номер,
# содержащий десятичные цифры, 52 латинские буквы (с учётом регистра) и символы из 1988-символьного специального алфавита.
# В базе данных для хранения каждого серийного номера отведено одинаковое и минимально возможное число байт.
# При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым и минимально возможным числом бит.
# Известно, что для хранения 1550 серийных номеров отведено не более 356 Кбайт памяти. Определите максимально возможную длину серийного номера.
# В ответе запишите только целое число.
# from math import *
# k = 1550
# N = 52 + 10 + 1988
# ids_size = 356 * 2 ** 10
# i = ceil(log2(N))
# I = int(ids_size / k)
# L = I * 8 / i
# print(L)

# На предприятии каждой изготовленной детали присваивают серийный номер,
# содержащий десятичные цифры и символы из 27-символьного специального алфавита.
# В базе данных каждый серийный номер занимает одинаковое и минимально возможное число байт.
# При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым и минимально возможным числом бит.
# Известно, что для хранения 3548 серийных номеров необходимо более 12 Кбайт памяти.

# from math import *
# k = 3548
# N = 10 + 27
# ids_size = 12 * 2 ** 10
# i = ceil(log2(N))
# I = ids_size / k
# L = I * 8 / i
# print(floor(L))

# При регистрации в компьютерной системе каждому объекту присваивается идентификатор,
# содержащий десятичные цифры, 26 латинских букв в верхнем регистре и символы из 2024-символьного специального алфавита.
# В базе данных для хранения каждого идентификатора отведено одинаковое и минимально возможное число байт.
# При этом используется посимвольное кодирование идентификаторов, все символы кодируются одинаковым и минимально возможным числом бит.
# Известно, что для хранения 2050 идентификаторов отведено более 1200 Кбайт памяти. Определите минимально возможную длину идентификатора.
# В ответе запишите только целое число

# from math import *
# k = 2050
# N = 10 + 26 + 2024
# ids_size = 1200 * 2 ** 10
# i = ceil(log2(N))
# I = ids_size / k
# L = I * 8 / i
# print(floor(L))
# Каждому изготовленному на заводе двигателю присваивается уникальный серийный номер,
# содержащий десятичные цифры и символы из 90-символьного специального алфавита.
# В базе данных каждый серийный номер занимает одинаковое и минимально возможное число байт.
# При этом используется посимвольное кодирование серийный номеров, все символы кодируются одинаковым и минимально возможным числом бит.
# Известно, что 1 200 000 серийных номеров занимают более 48 Мбайт памяти. Определите максимально возможную длину серийного номера.
# В ответе запишите только целое число.
from math import *
k = 1200000
N = 10 + 90
ids_size = 48 * 2 ** 20
i = ceil(log2(N))
I = ids_size / k
L = I * 8 / i
print(floor(L))




